# Series

In [4]:
import pandas as pd
obj = pd.Series([5,-1,3,8])
print(obj)

0    5
1   -1
2    3
3    8
dtype: int64

In [5]:
sales = pd.Series([100,500,100,300])
print(sales.values)
print(sales.index)

[100 500 100 300]
RangeIndex(start=0, stop=4, step=1)

In [6]:
sales = pd.Series([200,100,700,400], index=["Jan","Feb","Mar","Apr"])
print(sales)
print(sales.values)
print(sales.index)

Jan    200
Feb    100
Mar    700
Apr    400
dtype: int64
[200 100 700 400]
Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')

In [7]:
sales = pd.Series([200,100,700,400], index=["Jan","Feb","Mar","Apr"], name="Four Months Data")
print(sales)

Jan    200
Feb    100
Mar    700
Apr    400
Name: Four Months Data, dtype: int64

In [8]:
quantity = pd.Series([50,45,60,32,20,12,0], index=["Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"], name="One week canteen data")
print(quantity)

Monday       50
Tuesday      45
Wednesday    60
Thursday     32
Friday       20
Saturday     12
Sunday        0
Name: One week canteen data, dtype: int64

# Accessing Data

In [9]:
print(quantity[4])
print(quantity["Friday"])
print(quantity[6])

20
20
0

In [10]:
print(quantity[[1,3,5]])

Tuesday     45
Thursday    32
Saturday    12
Name: One week canteen data, dtype: int64

In [11]:
print(quantity[["Wednesday","Saturday"]])

Wednesday    60
Saturday     12
Name: One week canteen data, dtype: int64

In [12]:
print(quantity[quantity>20])

Monday       50
Tuesday      45
Wednesday    60
Thursday     32
Name: One week canteen data, dtype: int64

In [13]:
quantity*2
print(quantity)

Monday       50
Tuesday      45
Wednesday    60
Thursday     32
Friday       20
Saturday     12
Sunday        0
Name: One week canteen data, dtype: int64

In [14]:
quantity = quantity * 2
print(quantity)

Monday       100
Tuesday       90
Wednesday    120
Thursday      64
Friday        40
Saturday      24
Sunday         0
Name: One week canteen data, dtype: int64

In [15]:
print(quantity)

Monday       100
Tuesday       90
Wednesday    120
Thursday      64
Friday        40
Saturday      24
Sunday         0
Name: One week canteen data, dtype: int64

In [16]:
quantity = quantity / 2
print(quantity)

Monday       50.0
Tuesday      45.0
Wednesday    60.0
Thursday     32.0
Friday       20.0
Saturday     12.0
Sunday        0.0
Name: One week canteen data, dtype: float64

In [17]:
"Monday" in quantity

True

In [18]:
"Fraud" in quantity

False

In [19]:
import numpy as np
arr = np.array([5,2,3,4,9])
ind = np.array(['a','b','c','d','e'])
obj = pd.Series(arr, index = ind)
print(obj)

a    5
b    2
c    3
d    4
e    9
dtype: int32

In [20]:
sdata = {"Punjab" : 500000000, "Sindh" : 20000000, "Kpk" : "12000000", "Balochistan" : 5000000}
tax_by_state = pd.Series(sdata)
print(tax_by_state)
print(tax_by_state.index)

Punjab         500000000
Sindh           20000000
Kpk             12000000
Balochistan      5000000
dtype: object
Index(['Punjab', 'Sindh', 'Kpk', 'Balochistan'], dtype='object')

In [21]:
sdata = {"Punjab" : 500000000, "Sindh" : 20000000, "Kpk" : "12000000", "Balochistan" : 5000000}
tax_by_state = pd.Series(sdata, index = ["Balochistan","Kpk","Punjab","Sindh", "GB"])
print(tax_by_state)
print(tax_by_state.isnull())
tax_by_state.index = ["B", "K","P", "S", "G"]
print(tax_by_state)

Balochistan      5000000
Kpk             12000000
Punjab         500000000
Sindh           20000000
GB                   NaN
dtype: object
Balochistan    False
Kpk            False
Punjab         False
Sindh          False
GB              True
dtype: bool
B      5000000
K     12000000
P    500000000
S     20000000
G          NaN
dtype: object

# **Source of Data for Pandas Series**
* Direct insert data in the Series
* From numpy array
* From Dictionary

# Datarame

In [22]:
import pandas as pd

Apples = pd.Series([3, 4, 5, 6])
Oranges = pd.Series([7, 8, 9, 2])
Fruits = {"Apples" : Apples, "Oranges" : Oranges}
Table = pd.DataFrame(Fruits)
print(Table)

   Apples  Oranges
0       3        7
1       4        8
2       5        9
3       6        2

In [23]:
state = ["Ohio", "Ohio", "Ohio", "New York", "New York", "New York"]
data = {"State" : state,
        "Year" : [2000, 2001, 2002, 2003, 2004, 2005],
        "Pop" : [1.2, 1.6, 1.8, 2.1, 2.5, 2.7]}
state_pop_df = pd.DataFrame(data)
print(state_pop_df)
state_pop_df = pd.DataFrame(data, index = ["1st", "2nd", "3rd", "4th", "5th", "6th"])
print(state_pop_df)

      State  Year  Pop
0      Ohio  2000  1.2
1      Ohio  2001  1.6
2      Ohio  2002  1.8
3  New York  2003  2.1
4  New York  2004  2.5
5  New York  2005  2.7
        State  Year  Pop
1st      Ohio  2000  1.2
2nd      Ohio  2001  1.6
3rd      Ohio  2002  1.8
4th  New York  2003  2.1
5th  New York  2004  2.5
6th  New York  2005  2.7

In [24]:
state_pop_df.head()

        State  Year  Pop
1st      Ohio  2000  1.2
2nd      Ohio  2001  1.6
3rd      Ohio  2002  1.8
4th  New York  2003  2.1
5th  New York  2004  2.5

In [25]:
state_pop_df = pd.DataFrame(data , columns = ["Year", "State", "Pop"])
print(state_pop_df)

   Year     State  Pop
0  2000      Ohio  1.2
1  2001      Ohio  1.6
2  2002      Ohio  1.8
3  2003  New York  2.1
4  2004  New York  2.5
5  2005  New York  2.7

In [26]:
state_pop_df2 = pd.DataFrame(data , columns = ["Year", "State", "Pop", "Debt"] , index= ["1st","2nd", "3rd", "4th", "5th", "6th"])
state_pop_df2.head()

     Year     State  Pop Debt
1st  2000      Ohio  1.2  NaN
2nd  2001      Ohio  1.6  NaN
3rd  2002      Ohio  1.8  NaN
4th  2003  New York  2.1  NaN
5th  2004  New York  2.5  NaN

In [27]:
print(state_pop_df2.columns)
print(state_pop_df2.index)

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')
Index(['1st', '2nd', '3rd', '4th', '5th', '6th'], dtype='object')

# We can extract data through dictionary like notaion and through attribute style

In [28]:
state_pop_df2["Pop"]

1st    1.2
2nd    1.6
3rd    1.8
4th    2.1
5th    2.5
6th    2.7
Name: Pop, dtype: float64

# Attribute Style

In [29]:
state_pop_df2.Pop

1st    1.2
2nd    1.6
3rd    1.8
4th    2.1
5th    2.5
6th    2.7
Name: Pop, dtype: float64

In [30]:

state_pop_df2.loc["3rd"]

Year     2002
State    Ohio
Pop       1.8
Debt      NaN
Name: 3rd, dtype: object

In [37]:
state_pop_df2 = pd.DataFrame(data , columns = ["Year", "State", "Pop", "Debt"] , index= ["1st","2nd", "3rd", "4th", "5th", "6th"])
ln = len(state_pop_df2)
d = np.arange(ln)
state_pop_df2["Debt"]= d
state_pop_df2.head()

     Year     State  Pop  Debt
1st  2000      Ohio  1.2     0
2nd  2001      Ohio  1.6     1
3rd  2002      Ohio  1.8     2
4th  2003  New York  2.1     3
5th  2004  New York  2.5     4

In [43]:
val = pd.Series(["1.2", "1.5", "1.7", "1.2", "1.5", "1.7"], index= ["1st","2nd", "3rd", "4th", "5th", "6th"] )
state_pop_df2["Debt"]= val
state_pop_df2.head()

     Year     State  Pop Debt
1st  2000      Ohio  1.2  1.2
2nd  2001      Ohio  1.6  1.5
3rd  2002      Ohio  1.8  1.7
4th  2003  New York  2.1  1.2
5th  2004  New York  2.5  1.5

In [45]:
val = pd.Series(["1.2", "1.5", "1.7", "1.2", "1.5", "1.7"], index= ["Zero", "2nd", "3rd", "4th", "5th", "6th"] )
state_pop_df2["Debt"]= val
state_pop_df2.head()

     Year     State  Pop Debt
1st  2000      Ohio  1.2  NaN
2nd  2001      Ohio  1.6  1.5
3rd  2002      Ohio  1.8  1.7
4th  2003  New York  2.1  1.2
5th  2004  New York  2.5  1.5

In [46]:
val = pd.Series([ "1.5", "1.7", "1.5"], index= [ "3rd", "5th", "6th"] )
state_pop_df2["Debt"]= val
state_pop_df2.head()

     Year     State  Pop Debt
1st  2000      Ohio  1.2  NaN
2nd  2001      Ohio  1.6  NaN
3rd  2002      Ohio  1.8  1.5
4th  2003  New York  2.1  NaN
5th  2004  New York  2.5  1.7

In [47]:
state_pop_df2["Debt"]= 22.5
state_pop_df2.head()

     Year     State  Pop  Debt
1st  2000      Ohio  1.2  22.5
2nd  2001      Ohio  1.6  22.5
3rd  2002      Ohio  1.8  22.5
4th  2003  New York  2.1  22.5
5th  2004  New York  2.5  22.5